#Homework10 task1
"""
Завдання 1. Оптимізація виробництва

Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік".
Для виробництва цих напоїв використовуються різні інгредієнти та
обмежена кількість обладнання. Задача полягає у максимізації 
виробництва, враховуючи обмежені ресурси.
"""

import pulp

# Ініціалізація моделі
model = pulp.LpProblem("Maximize_Production", pulp.LpMaximize)

# Визначення змінних
A = pulp.LpVariable('A', lowBound=0, cat='Integer')  # Кількість продукту A
B = pulp.LpVariable('B', lowBound=0, cat='Integer')  # Кількість продукту B

# Функція цілі (Максимізація виробітку продуктів)
model += A + B, "Total_Production"

# Додавання обмежень
model += 2 * A + 1 * B <= 100   # Обмеження по воді
model += 1 * A <= 50  # Обмеження по цукру
model += 1 * A <= 30  # Обмеження по лимонному соку
model += 2 * B <= 40  # Обмеження по пюре

# Розв'язання моделі
model.solve()

# Вивід результатів
print("Виробляти продуктів A:", A.varValue)
print("Виробляти продуктів B:", B.varValue)
print("Максимальний прибуток:", pulp.value(model.objective))
